jamesmunns/kinetis-rs/platform/hal/lpuart/fsl_lpuart_hal.h
/*! @brief LPUART interrupt configuration structure, default settings are 0 (disabled)*/
typedef enum _lpuart_interrupt {
    kLpuartIntLinBreakDetect     = LPUART_BAUD_REG_ID << LPUART_SHIFT | BP_LPUART_BAUD_LBKDIE,  /*!< LIN break detect. */
    kLpuartIntRxActiveEdge       = LPUART_BAUD_REG_ID << LPUART_SHIFT | BP_LPUART_BAUD_RXEDGIE, /*!< RX Active Edge. */
    kLpuartIntTxDataRegEmpty     = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_TIE,     /*!< Transmit data register empty. */
    kLpuartIntTxComplete         = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_TCIE,    /*!< Transmission complete. */
    kLpuartIntRxDataRegFull      = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_RIE,     /*!< Receiver data register full. */
    kLpuartIntIdleLine           = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_ILIE,    /*!< Idle line. */
    kLpuartIntRxOverrun          = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_ORIE,    /*!< Receiver Overrun. */
    kLpuartIntNoiseErrFlag       = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_NEIE,    /*!< Noise error flag. */
    kLpuartIntFrameErrFlag       = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_FEIE,    /*!< Framing error flag. */
    kLpuartIntParityErrFlag      = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_PEIE,    /*!< Parity error flag. */
#if FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
    kLpuartIntMatchAddrOne       = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_MA1IE,   /*!< Match address one flag. */
    kLpuartIntMatchAddrTwo       = LPUART_CTRL_REG_ID << LPUART_SHIFT | BP_LPUART_CTRL_MA2IE,   /*!< Match address two flag. */
#endif
} lpuart_interrupt_t;


/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name LPUART Common Configurations
 * @{
 */

/*!
 * @brief Initializes the LPUART controller to known state.
 *
 * @param baseAddr LPUART base address.
 */
void LPUART_HAL_Init(uint32_t baseAddr);

/*!
 * @brief Enables the LPUART transmitter.
 *
 * @param baseAddr LPUART base address.
 */
void LPUART_HAL_EnableTransmitter(uint32_t baseAddr);

/*!
 * @brief Disables the LPUART transmitter.
 *
 * @param baseAddr LPUART base address
 */
static inline void LPUART_HAL_DisableTransmitter(uint32_t baseAddr)
{
    BW_LPUART_CTRL_TE(baseAddr, 0);
}

/*!
 * @brief Gets the LPUART transmitter enabled/disabled configuration.
 *
 * @param baseAddr LPUART base address
 * @return State of LPUART transmitter enable(1)/disable(0)
 */
static inline bool LPUART_HAL_IsTransmitterEnabled(uint32_t baseAddr)
{
    return BR_LPUART_CTRL_TE(baseAddr);
}

/*!
 * @brief Enables the LPUART receiver.
 *
 * @param baseAddr LPUART base address
 */
static inline void LPUART_HAL_EnableReceiver(uint32_t baseAddr)
{
    BW_LPUART_CTRL_RE(baseAddr, 1);
}

/*!
 * @brief Disables the LPUART receiver.
 *
 * @param baseAddr LPUART base address
 */
static inline void LPUART_HAL_DisableReceiver(uint32_t baseAddr)
{
    BW_LPUART_CTRL_RE(baseAddr, 0);
}

/*!
 * @brief Gets the LPUART receiver enabled/disabled configuration.
 *
 * @param baseAddr LPUART base address
 * @return State of LPUART receiver enable(1)/disable(0)
 */
static inline bool LPUART_HAL_IsReceiverEnabled(uint32_t baseAddr)
{
    return BR_LPUART_CTRL_RE(baseAddr);
}

/*!
 * @brief Configures the LPUART baud rate.
 *
 *  In some LPUART instances the user must disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address.
 * @param   sourceClockInHz      LPUART source input clock in Hz.
 * @param   desiredBaudRate      LPUART desired baud rate.
 * @return  An error code or kStatus_Success
 */
lpuart_status_t LPUART_HAL_SetBaudRate(uint32_t baseAddr, uint32_t sourceClockInHz,
                                uint32_t desiredBaudRate);

/*!
 * @brief Sets the LPUART baud rate modulo divisor.
 *
 * @param baseAddr LPUART base address.
 * @param   baudRateDivisor The baud rate modulo division "SBR"
 */
static inline void LPUART_HAL_SetBaudRateDivisor(uint32_t baseAddr, uint32_t baudRateDivisor)
{
    assert ((baudRateDivisor < 0x1FFF) && (baudRateDivisor > 1));
    BW_LPUART_BAUD_SBR(baseAddr, baudRateDivisor);
}

#if FSL_FEATURE_LPUART_HAS_BAUD_RATE_OVER_SAMPLING_SUPPORT
/*!
 * @brief Sets the LPUART baud rate oversampling ratio (Note: Feature available on select
 *        LPUART instances used together with baud rate programming)
 *        The oversampling ratio should be set between 4x (00011) and 32x (11111). Writing
 *        an invalid oversampling ratio results in an error and is set to a default
 *        16x (01111) oversampling ratio.
 *        IDisable the transmitter/receiver before calling
 *        this function.
 *
 * @param baseAddr LPUART base address.
 * @param   overSamplingRatio The oversampling ratio "OSR"
 */
static inline void LPUART_HAL_SetOversamplingRatio(uint32_t baseAddr, uint32_t overSamplingRatio)
{
    assert(overSamplingRatio < 0x1F);
    BW_LPUART_BAUD_OSR(baseAddr, overSamplingRatio);
}
#endif

#if FSL_FEATURE_LPUART_HAS_BOTH_EDGE_SAMPLING_SUPPORT
/*!
 * @brief Configures the LPUART baud rate both edge sampling (Note: Feature available on select
 *        LPUART instances used with baud rate programming)
 *        When enabled, the received data is sampled on both edges of the baud rate clock.
 *        This must be set when the oversampling ratio is between 4x and 7x.
 *        This function should only be called when the receiver is disabled.
 *
 * @param baseAddr LPUART base address.
 * @param   enableBothEdgeSampling Enable (1) or Disable (0) Both Edge Sampling
 * @return  An error code or kStatus_Success
 */
static inline void LPUART_HAL_SetBothEdgeSamplingCmd(uint32_t baseAddr, bool enableBothEdgeSampling)
{
    BW_LPUART_BAUD_BOTHEDGE(baseAddr, enableBothEdgeSampling);
}
#endif

/*!
 * @brief Configures the number of bits per character in the LPUART controller.
 *
 *  In some LPUART instances, the user should disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address.
 * @param   bitCountPerChar   Number of bits per char (8, 9, or
 *                            10, depending on the LPUART instance)
 */
void LPUART_HAL_SetBitCountPerChar(uint32_t baseAddr, lpuart_bit_count_per_char_t bitCountPerChar);


/*!
 * @brief Configures parity mode in the LPUART controller.
 * 
 *  In some LPUART instances, the user should disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address.
 * @param   parityModeType  Parity mode (enabled, disable, odd, even - see parity_mode_t struct)
 */
void LPUART_HAL_SetParityMode(uint32_t baseAddr, lpuart_parity_mode_t parityModeType);

/*!
 * @brief Configures the number of stop bits in the LPUART controller.
 *  In some LPUART instances, the user should disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address.
 * @param   stopBitCount      Number of stop bits (1 or 2 - see lpuart_stop_bit_count_t struct)
 * @return  An error code (an unsupported setting in some LPUARTs) or kStatus_Success
 */
static inline void LPUART_HAL_SetStopBitCount(uint32_t baseAddr, lpuart_stop_bit_count_t stopBitCount)
{
    /* configure the number of stop bits */
    BW_LPUART_BAUD_SBNS(baseAddr, stopBitCount);
}

/*!
 * @brief Configures the transmit and receive inversion control in the LPUART controller.
 *
 * This function should only be called when the LPUART is between transmit and receive packets.
 *
 * @param baseAddr LPUART base address.
 * @param   rxInvert     Enable (1) or disable (0) receive inversion
 * @param   txInvert     Enable (1) or disable (0) transmit inversion
 */
void LPUART_HAL_SetTxRxInversionCmd(uint32_t baseAddr, uint32_t rxInvert, uint32_t txInvert);

/*@}*/

/*!
 * @name LPUART Interrupts and DMA
 * @{
 */

/*!
 * @brief Configures the LPUART module interrupts to enable/disable various interrupt sources.
 *
 * @param   baseAddr LPUART module base address.
 * @param   interrupt LPUART interrupt configuration data.
 * @param   enable   true: enable, false: disable.
 */
void LPUART_HAL_SetIntMode(uint32_t baseAddr, lpuart_interrupt_t interrupt, bool enable);

/*!
 * @brief Returns whether the LPUART module interrupts is enabled/disabled.
 *
 * @param   baseAddr LPUART module base address.
 * @param   interrupt LPUART interrupt configuration data.
 * @return  true: enable, false: disable.
 */
bool LPUART_HAL_GetIntMode(uint32_t baseAddr, lpuart_interrupt_t interrupt);

/*!
 * @brief Enable/Disable the transmission_complete_interrupt.
 *
 * @param baseAddr LPUART base address
 * @param   enable   true: enable, false: disable.
 */
static inline void LPUART_HAL_SetTxDataRegEmptyIntCmd(uint32_t baseAddr, bool enable)
{
    BW_LPUART_CTRL_TIE(baseAddr, enable);
}

/*!
 * @brief Gets the configuration of the transmission_data_register_empty_interrupt enable setting.
 *
 * @param baseAddr LPUART base address
 * @return  Bit setting of the interrupt enable bit
 */
static inline bool LPUART_HAL_GetTxDataRegEmptyIntCmd(uint32_t baseAddr)
{
    return BR_LPUART_CTRL_TIE(baseAddr);
}

/*!
 * @brief Enables the rx_data_register_full_interrupt.
 *
 * @param baseAddr LPUART base address
 * @param   enable   true: enable, false: disable.
 */
static inline void LPUART_HAL_SetRxDataRegFullIntCmd(uint32_t baseAddr, bool enable)
{
    BW_LPUART_CTRL_RIE(baseAddr, enable);
}

/*!
 * @brief Gets the configuration of the rx_data_register_full_interrupt enable.
 *
 * @param baseAddr LPUART base address
 * @return Bit setting of the interrupt enable bit
 */
static inline bool LPUART_HAL_GetRxDataRegFullIntCmd(uint32_t baseAddr)
{
    return BR_LPUART_CTRL_RIE(baseAddr);
}

#if FSL_FEATURE_LPUART_HAS_DMA_ENABLE 
/*!
 * @brief  LPUART configures DMA requests for Transmitter and Receiver.
 *
 * @param baseAddr LPUART base address
 * @param   txDmaConfig    Transmit DMA request configuration (enable:1 /disable: 0)
 * @param   rxDmaConfig    Receive DMA request configuration (enable: 1/disable: 0)
 */
void LPUART_HAL_ConfigureDma(uint32_t baseAddr, bool txDmaConfig, bool rxDmaConfig);

/*!
 * @brief  Gets the LPUART Transmit DMA request configuration.
 *
 * @param baseAddr LPUART base address
 * @return   Transmit DMA request configuration (enable: 1/disable: 0)
 */
static inline bool LPUART_HAL_IsTxDmaEnabled(uint32_t baseAddr)
{
    /* TDMAE configures the transmit data register empty flag, S1[TDRE], to */
    /* generate a DMA request. */
    return BR_LPUART_BAUD_TDMAE(baseAddr);
}

/*!
 * @brief  Gets the LPUART receive DMA request configuration.
 *
 * @param baseAddr LPUART base address
 * @return   Receives the DMA request configuration (enable: 1/disable: 0).
 */
static inline bool LPUART_HAL_IsRxDmaEnabled(uint32_t baseAddr)
{
    /* RDMAE configures the receive data register fell flag, S1[RDRF], to */
    /* generate a DMA request. */
    return BR_LPUART_BAUD_RDMAE(baseAddr);
}

#endif

/*@}*/

/*! 
 * @name LPUART Transfer Functions
 * @{
 */

/*!
 * @brief Sends the LPUART 8-bit character.
 *
 * @param baseAddr LPUART Instance
 * @param data     data to send (8-bit)
 */
static inline void LPUART_HAL_Putchar(uint32_t baseAddr, uint8_t data)
{
    /* put 8-bit data into the lpuart data register */
    HW_LPUART_DATA_WR(baseAddr, data);
}

/*!
 * @brief Sends the LPUART 9-bit character.
 *
 * @param baseAddr LPUART Instance
 * @param data     data to send (9-bit)
 */
void LPUART_HAL_Putchar9(uint32_t baseAddr, uint16_t data);

/*!
 * @brief Sends the LPUART 10-bit character (Note: Feature available on select LPUART instances).
 *
 * @param baseAddr LPUART Instance
 * @param   data        data to send (10-bit)
 * @return  An error code or kStatus_Success
 */
lpuart_status_t LPUART_HAL_Putchar10(uint32_t baseAddr, uint16_t data);

/*!
 * @brief Gets the LPUART 8-bit character.
 *
 * @param baseAddr LPUART base address
 * @param   readData    data read from receive (8-bit)
 */
void  LPUART_HAL_Getchar(uint32_t baseAddr, uint8_t *readData);

/*!
 * @brief Gets the LPUART 9-bit character.
 *
 * @param baseAddr LPUART base address
 * @param   readData    data read from receive (9-bit)
 */
void  LPUART_HAL_Getchar9(uint32_t baseAddr, uint16_t *readData);

/*!
 * @brief Gets the LPUART 10-bit character.
 *
 * @param baseAddr LPUART base address
 * @param   readData    data read from receive (10-bit)
 * @return  An error code or kStatus_Success
 */
lpuart_status_t LPUART_HAL_Getchar10(uint32_t baseAddr, uint16_t *readData);

/*!
 * @brief Configures the number of idle characters that must be received before the IDLE flag is set.
 *
 * @param baseAddr LPUART base address
 * @param   idle_config    idle characters configuration
 */
static inline void LPUART_HAL_IdleConfig(uint32_t baseAddr, lpuart_idle_config_t idleConfig)
{
    BW_LPUART_CTRL_IDLECFG(baseAddr, idleConfig);
}

/*!
 * @brief Gets the configuration of the number of idle characters that must be received before the IDLE flag is set.
 *
 * @param baseAddr LPUART base address
 * @return  idle characters configuration
 */
static inline lpuart_idle_config_t LPUART_HAL_GetIdleconfig(uint32_t baseAddr)
{
    /* get the receiver idle character config based on the LPUART baseAddr */
    return (lpuart_idle_config_t)BR_LPUART_CTRL_IDLECFG(baseAddr);
}

#if FSL_FEATURE_LPUART_HAS_EXTENDED_DATA_REGISTER_FLAGS
/*!
 * @brief  Configures  bit10 (if enabled) or bit9 (if disabled) as the parity bit in the serial
 *         transmission.
 * This sets LPUARTx_C4[M10] - it is also required to set LPUARTx_C1[M] and LPUARTx_C1[PE]
 *
 * @param baseAddr LPUART base address
 * @param  enable  Enable (1) to configure bit10 as the parity bit, disable (0) to
 *                 configure bit 9 as the parity bit in the serial transmission
 */
static inline void LPUART_HAL_ConfigureBit10AsParityBitOperation(uint32_t baseAddr, bool enable)
{
    /* to enable the parity bit as the tenth data bit, along with enabling LPUARTx_C4[M10] */
    /* need to also enable parity and set LPUARTx_CTRL[M] bit */
    /* assumed that the user has already set the appropriate bits */
    BW_LPUART_BAUD_M10(baseAddr, enable);
}

/*!
 * @brief  Gets the configuration of bit10 (if enabled) or bit9 (if disabled) as the
 *         parity bit in the serial transmission.
 *
 * @param baseAddr LPUART base address
 * @return  Configuration of bit10 (enabled (1)), or bit 9 (disabled (0)) as the
 *          parity bit in the serial transmission
 */
static inline bool LPUART_HAL_IsBit10SetAsParityBit(uint32_t baseAddr)
{
    /* to see if the parity bit is set as the tenth data bit, */
    /* return value of LPUARTx_BAUD[M10] */
    return BR_LPUART_BAUD_M10(baseAddr);
}

/*!
 * @brief  Checks whether the current data word was received with noise.
 *
 * @param baseAddr LPUART base address.
 * @return  The status of the NOISY bit in the LPUART extended data register
 */
static inline bool LPUART_HAL_IsCurrentDatawordReceivedWithNoise(uint32_t baseAddr)
{
    /* to see if the current dataword was received with noise, */
    /* return value of LPUARTx_DATA[NOISY] */
    return BR_LPUART_DATA_NOISY(baseAddr);
}

/*!
 * @brief  Checks whether the receive buffer is empty.
 *
 * @param baseAddr LPUART base address
 * @return   TRUE if the receive-buffer is empty.
 */
static inline bool LPUART_HAL_IsReceiveBufferEmpty(uint32_t baseAddr)
{
    /* to see if the current state of data buffer is empty, */
    /* return value of LPUARTx_DATA[RXEMPT] */
    return BR_LPUART_DATA_RXEMPT(baseAddr);
}

/*!
 * @brief  Checks whether  the previous BUS state was idle before this byte is received.
 *
 * @param baseAddr LPUART base address
 * @return   TRUE if the previous BUS state was IDLE.
 */
static inline bool LPUART_HAL_ItWasPreviousBusStateIdle(uint32_t baseAddr)
{
    /* to see if the current dataword was received with parity error, */
    /* return value of LPUARTx_DATA[PARITYE] */
    return BR_LPUART_DATA_IDLINE(baseAddr);
}

/*!
 * @brief  Checks whether  the current data word was received with parity error.
 *
 * @param baseAddr LPUART base address
 * @return  The status of the PARITYE bit in the LPUART extended data register
 */
static inline bool LPUART_HAL_IsCurrentDatawordReceivedWithParityError(uint32_t baseAddr)
{
    /* to see if the current dataword was received with parity error, */
    /* return value of LPUARTx_DATA[PARITYE] */
    return BR_LPUART_DATA_PARITYE(baseAddr);
}
#endif  /* FSL_FEATURE_LPUART_HAS_EXTENDED_DATA_REGISTER_FLAGS */

/*@}*/

/*! 
 * @name LPUART Special Feature Configurations
 * @{
 */

/*!
 * @brief Configures the LPUART operation in wait mode (operates or stops operations in wait mode).
 *  In some LPUART instances, the user should disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address
 * @param   mode        LPUART wait mode operation - operates or stops to operate in wait mode.
 */
static inline void  LPUART_HAL_SetWaitModeOperation(uint32_t baseAddr, lpuart_operation_config_t mode)
{
    /* configure lpuart operation in wait mode */
    /* In CPU wait mode: 0 - lpuart clocks continue to run; 1 - lpuart clocks freeze */
    BW_LPUART_CTRL_DOZEEN(baseAddr, mode);
}

/*!
 * @brief Gets the LPUART operation in wait mode (operates or stops operations in wait mode).
 *
 * @param baseAddr LPUART base address
 * @return   LPUART wait mode operation configuration - kLpuartOperates or KLpuartStops in wait mode
 */
lpuart_operation_config_t LPUART_HAL_GetWaitModeOperationConfig(uint32_t baseAddr);

/*!
 * @brief Configures the LPUART loopback operation (enable/disable loopback operation)
 *
 *  In some LPUART instances, the user should disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address
 * @param   enable        LPUART loopback mode - disabled (0) or enabled (1)
 */
void LPUART_HAL_SedLoopbackCmd(uint32_t baseAddr, bool enable);

/*!
 * @brief Configures the LPUART single-wire operation (enable/disable single-wire mode)
 *
 *  In some LPUART instances, the user should disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address
 * @param   enable        LPUART loopback mode - disabled (0) or enabled (1)
 */
void LPUART_HAL_SetSingleWireCmd(uint32_t baseAddr, bool enable);

/*!
 * @brief Configures the LPUART transmit direction while in single-wire mode.
 *
 * @param baseAddr LPUART base address
 * @param   direction   LPUART single-wire transmit direction - input or output
 */
static inline void LPUART_HAL_ConfigureTxdirInSinglewireMode(uint32_t baseAddr,
                                                 lpuart_singlewire_txdir_t direction)
{
    /* configure LPUART transmit direction (input or output) when in single-wire mode */
    /* it is assumed LPUART is in single-wire mode */
    BW_LPUART_CTRL_TXDIR(baseAddr, direction);
}

/*!
 * @brief  Places the LPUART receiver in standby mode.
 *
 * In some LPUART instances,
 * before placing LPUART in standby mode, first determine whether the receiver is set to
 * wake on idle or whether it is already in idle state.
 * NOTE that the RWU should only be set with C1[WAKE] = 0 (wakeup on  idle) if the channel is currently
 * not idle.
 * This can be determined by the S2[RAF] flag. If it is set to wake up an IDLE event and the channel is
 * already idle, it is possible that the LPUART will discard data since data must be received
 * (or a LIN break detect) after an IDLE is detected and before IDLE is allowed to reasserted.
 *
 * @param baseAddr LPUART base address
 * @return Error code or kStatus_Success
 */
lpuart_status_t LPUART_HAL_PutReceiverInStandbyMode(uint32_t baseAddr);

/*!
 * @brief  Places the LPUART receiver in a normal mode (disable standby mode operation).
 *
 * @param baseAddr LPUART base address
 */
static inline void LPUART_HAL_PutReceiverInNormalMode(uint32_t baseAddr)
{
    /* clear the RWU bit to place receiver into normal mode (disable standby mode) */
    BW_LPUART_CTRL_RWU(baseAddr, 0);
}

/*!
 * @brief  Checks whether the LPUART receiver is in a standby mode.
 *
 * @param baseAddr LPUART base address
 * @return LPUART in normal more (0) or standby (1)
 */
static inline bool LPUART_HAL_IsReceiverInStandby(uint32_t baseAddr)
{
    /* return the RWU bit setting (0 - normal more, 1 - standby) */
    return BR_LPUART_CTRL_RWU(baseAddr);
}

/*!
 * @brief  LPUART receiver wakeup method (idle line or addr-mark) from standby mode
 *
 * @param baseAddr LPUART base address
 * @param   method        LPUART wakeup method: 0 - Idle-line wake (default), 1 - addr-mark wake
 */
static inline void LPUART_HAL_SelectReceiverWakeupMethod(uint32_t baseAddr, lpuart_wakeup_method_t method)
{
    /* configure the WAKE bit for idle line wake or address mark wake */
    BW_LPUART_CTRL_WAKE(baseAddr, method);
}

/*!
 * @brief  Gets the LPUART receiver wakeup method (idle line or addr-mark) from standby mode.
 *
 * @param baseAddr LPUART base address
 * @return  LPUART wakeup method: kLpuartIdleLineWake: 0 - Idle-line wake (default),
 *          kLpuartAddrMarkWake: 1 - addr-mark wake
 */
lpuart_wakeup_method_t LPUART_HAL_GetReceiverWakeupMethod(uint32_t baseAddr);

/*!
 * @brief  LPUART idle-line detect operation configuration (idle line bit-count start and wake
 *         up affect on IDLE status bit).
 *
 *  In some LPUART instances, the user should disable the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address
 * @param   config        LPUART configuration data for idle line detect operation
 */
void LPUART_HAL_ConfigureIdleLineDetect(uint32_t baseAddr,
                                         const lpuart_idle_line_config_t *config);

