jamesmunns/kinetis-rs/platform/hal/lpuart/fsl_lpuart_hal.h
/*!
 * @brief  LPUART break character transmit length configuration
 *  In some LPUART instances, the user should disable the transmitter before calling
 *  this function. Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address
 * @param   length   LPUART break character length setting: 0 - minimum 10-bit times (default),
 *                   1 - minimum 13-bit times
 */
static inline void LPUART_HAL_SetBreakCharTransmitLength(uint32_t baseAddr,
                                             lpuart_break_char_length_t length)
{
    /* Configure BRK13 - Break Character transmit length configuration */
    /* LPUART break character length setting: */
    /* 0 - minimum 10-bit times (default), */
    /* 1 - minimum 13-bit times */
    BW_LPUART_STAT_BRK13(baseAddr, length);
}

/*!
 * @brief  LPUART break character detect length configuration
 *
 * @param baseAddr LPUART base address
 * @param   length  LPUART break character length setting: 0 - minimum 10-bit times (default),
 *                  1 - minimum 13-bit times
 */
static inline void LPUART_HAL_SetBreakCharDetectLength(uint32_t baseAddr,
                                           lpuart_break_char_length_t length)
{
    /* Configure LBKDE - Break Character detect length configuration */
    /* LPUART break character length setting: */
    /* 0 - minimum 10-bit times (default), */
    /* 1 - minimum 13-bit times */
    BW_LPUART_STAT_LBKDE(baseAddr, length);
}

/*!
 * @brief  LPUART transmit sends break character configuration.
 *
 * @param baseAddr LPUART base address
 * @param   enable LPUART normal/queue break char - disabled (normal mode, default: 0) or
 *                 enabled (queue break char: 1)
 */
static inline void LPUART_HAL_QueueBreakCharToSend(uint32_t baseAddr, bool enable)
{
    /* Configure SBK - Send Break */
    /* LPUART send break character setting: */
    /* 0 - normal transmitter operation, */
    /* 1 - Queue break character(s) to be sent */

    BW_LPUART_CTRL_SBK(baseAddr, enable);
}

/*!
 * @brief  LPUART configures match address mode control (Note: Feature available on
 *         select LPUART instances)
 *
 * @param baseAddr LPUART base address
 * @param   matchAddrMode1   MAEN1: match address mode1 enable (1)/disable (0)
 * @param   matchAddrMode2   MAEN2: match address mode2 enable (1)/disable (0)
 * @param   matchAddrValue1   MA: match address value to program into match address register 1
 * @param   matchAddrValue2   MA: match address value to program into match address register 2
 * @param   config            MATCFG: Configures the match addressing mode used.
 * @return  An error code or kStatus_Success
 */
lpuart_status_t LPUART_HAL_SetMatchAddressOperation(uint32_t baseAddr,
                                   bool matchAddrMode1, bool matchAddrMode2,
                                   uint8_t matchAddrValue1, uint8_t matchAddrValue2,
                                   lpuart_match_config_t config);

/*!
 * @brief  LPUART sends the MSB first configuration (Note: Feature available on select LPUART instances)
 *  In some LPUART instances, the user should disable  the transmitter/receiver
 *  before calling this function.
 *  Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param baseAddr LPUART base address
 * @param   enable  MSB first mode configuration, MSBF: 0 - LSB (default, feature disabled),
 *                  1 - MSB (feature enabled)
 */
static inline void LPUART_HAL_ConfigureSendMsbFirstOperation(uint32_t baseAddr, bool enable)
{
    BW_LPUART_STAT_MSBF(baseAddr, enable);
}

/*!
 * @brief  LPUART disables re-sync of received data configuration (Note: Feature available on
 *         select LPUART instances).
 *
 * @param baseAddr LPUART base address
 * @param   enable  disable re-sync of received data word configuration, RESYNCDIS:
 *                  0 - re-sync of received data word (default, feature disabled),
 *                  1 - disable the re-sync (feature enabled)
 */
static inline void LPUART_HAL_ConfigureReceiveResyncDisableOperation(uint32_t baseAddr, bool enable)
{
    /* When set, disables the resynchronization of the received data word when a data */
    /* one followed by data zero transition is detected. This bit should only be changed */
    /*  when the receiver is disabled. */
    BW_LPUART_BAUD_RESYNCDIS(baseAddr, enable);
}

#if FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
/*!
 * @brief  Transmits the CTS source configuration.
 *
 * @param baseAddr LPUART base address
 * @param   source    LPUART CTS source
 */
static inline void LPUART_HAL_SelectSourceCts(uint32_t baseAddr, lpuart_cts_source_t source)
{
    /* Set TXCTSSRC */
    BW_LPUART_MODIR_TXCTSSRC(baseAddr, source);
}

/*!
 * @brief  Transmits the CTS configuration.
 * Note: configures if the CTS state is checked at the start of each character or only when the transmitter is idle.
 *
 * @param baseAddr LPUART base address
 * @param   config    LPUART CTS configuration
 */
static inline void LPUART_HAL_ConfigureCts(uint32_t baseAddr, lpuart_cts_config_t config)
{
    /* Set TXCTSC */
    BW_LPUART_MODIR_TXCTSC(baseAddr, config);
}

/*!
 * @brief  Enables  the receiver request-to-send.
 * Note: do not enable both Receiver RTS (RXRTSE) and Transmit RTS (TXRTSE).
 *
 * @param baseAddr LPUART base address
 * @param   enable  disable(0)/enable(1) receiver RTS.
 */

static inline void LPUART_HAL_SetReceiverRts(uint32_t baseAddr, bool enable)
{
    BW_LPUART_MODIR_RXRTSE(baseAddr, enable);
}

/*!
 * @brief  Enables the transmitter request-to-send.
 * Note: do not enable both Receiver RTS (RXRTSE) and Transmit RTS (TXRTSE).
 *
 * @param baseAddr LPUART base address
 * @param   enable  disable(0)/enable(1) transmitter RTS.
 */
static inline void LPUART_HAL_SetTransmitterRtsCmd(uint32_t baseAddr, bool enable)
{
    BW_LPUART_MODIR_TXRTSE(baseAddr, enable);
}

/*!
 * @brief  Configures the transmitter RTS polarity: 0=active low, 1=active high.
 *
 * @param baseAddr LPUART base address
 * @param   polarity    Settings to choose RTS polarity.
 */
static inline void LPUART_HAL_SetTransmitterRtsPolarityMode(uint32_t baseAddr, bool polarity)
{
    /* Configure the transmitter rts polarity: 0=active low, 1=active high */
    BW_LPUART_MODIR_TXRTSPOL(baseAddr, polarity);
}

/*!
 * @brief  Enables the transmitter clear-to-send.
 *
 * @param baseAddr LPUART base address
 * @param   enable  disable(0)/enable(1) transmitter CTS.
 */
static inline void LPUART_HAL_SetTransmitterCtsCmd(uint32_t baseAddr, bool enable)
{
    BW_LPUART_MODIR_TXCTSE(baseAddr, enable);
}

