jamesmunns/kinetis-rs/platform/hal/lpuart/fsl_lpuart_hal.h
#endif  /* FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT */

#if FSL_FEATURE_LPUART_HAS_IR_SUPPORT
/*!
 * @brief  Configures the LPUART infrared operation.
 *
 * @param baseAddr LPUART base address
 * @param   enable    Enable (1) or disable (0) the infrared operation
 * @param   pulseWidth    The transmit narrow pulse width of type lpuart_ir_tx_pulsewidth_t
 */
void LPUART_HAL_SetInfraredOperation(uint32_t baseAddr, bool enable,
                                     lpuart_ir_tx_pulsewidth_t pulseWidth);
#endif  /* FSL_FEATURE_LPUART_HAS_IR_SUPPORT */

/*@}*/

/*!
 * @name LPUART Status Flags
 * @{
 */

/*!
 * @brief  LPUART get status flag
 *
 * @param baseAddr LPUART base address
 * @param   statusFlag  The status flag to query
 */
bool LPUART_HAL_GetStatusFlag(uint32_t baseAddr, lpuart_status_flag_t statusFlag);

/*!
 * @brief  Gets the LPUART Transmit data register empty flag.
 *
 * This function returns the state of the LPUART Transmit data register empty flag.
 *
 * @param baseAddr LPUART module base address.
 * @return The status of Transmit data register empty flag, which is set when transmit buffer
 *          is empty.
 */
static inline bool LPUART_HAL_IsTxDataRegEmpty(uint32_t baseAddr)
{
    /* return status condition of TDRE flag  */
    return BR_LPUART_STAT_TDRE(baseAddr);
}

/*!
 * @brief  Gets the LPUART receive data register full flag.
 *
 * @param baseAddr LPUART base address
 * @return  Status of the receive data register full flag, sets when the receive data buffer is full.
 */
static inline bool LPUART_HAL_IsRxDataRegFull(uint32_t baseAddr)
{
    /* return status condition of RDRF flag  */
    return BR_LPUART_STAT_RDRF(baseAddr);
}

/*!
 * @brief  Gets the LPUART transmission complete flag.
 *
 * @param   baseAddr    LPUART base address
 * @return  Status of Transmission complete flag, sets when transmitter is idle
 *          (transmission activity complete)
 */
static inline bool LPUART_HAL_IsTxComplete(uint32_t baseAddr)
{
    /* return status condition of TC flag  */
    return BR_LPUART_STAT_TC(baseAddr);
}

/*!
 * @brief  LPUART clears an individual status flag (see lpuart_status_flag_t for list of status bits).
 *
 * @param baseAddr LPUART base address
 * @param   statusFlag  Desired LPUART status flag to clear
 * @return  An error code or kStatus_Success
 */
lpuart_status_t LPUART_HAL_ClearStatusFlag(uint32_t baseAddr, lpuart_status_flag_t statusFlag);

/*!
 * @brief  LPUART clears ALL status flags.
 *
 * @param baseAddr LPUART base address
 */
void LPUART_HAL_ClearAllNonAutoclearStatusFlags(uint32_t baseAddr);

/*@}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_LPUART_HAL_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

